app/views/microposts/_micropost.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
  </td>
  <% user = micropost.user rescue User.find(micropost.user_id) %>