app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("user_id", "content", "updated_at", "created_at") VALUES (1, 'Привет, Мир!', '2011-05-21 22:55:55.552734', '2011-05-21 22:55:55.552734')
---
  def create
	  @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save