app/controllers/users_controller.rb

   def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "name", "created_at", "email", "encrypted_password", "admin", "salt") VALUES ('2011-05-22 09:38:58.321289', 'Artem', '2011-05-22 09:38:58.321289', 'grom20000noname@mail.ru', 'a05b0c43bc6979690995d619775ca089fb732f19e2afee34b110966e29588b5d', 'f', '0c4d5ea8718735084c360fa389d0ea05fb01f687db4e5cbc26493133f6a4b466')

   def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-05-21 17:12:10.426757', "name" = 'Example Users' WHERE "users"."id" = 1

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"